app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
---
  def new
    @post = Post.find_by(id: params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "{\"comment\"=>\"THIS IS A COMMMMMMMENT!\"}"], ["post_id", 1], ["created_at", "2015-05-31 18:57:56.888926"], ["updated_at", "2015-05-31 18:57:56.888926"]]
---
  def create
    post = Post.find_by(id: params[:post_id])
    post.comments.create(comment: params[:comment])