app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @post = Post.find_by(id: params[:id])

INSERT INTO "posts" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "heeelp"], ["text", "ples"], ["created_at", "2015-05-30 22:40:29.083265"], ["updated_at", "2015-05-30 22:40:29.083265"]]
---
  def create
    post = params[:post]
    title = post[:title]
    text = post[:text]
    @post = Post.create(title: title, text: text)